# ToposolidBooleanPerturbationFailures Properties

---
The BuiltInFailuresToposolidBooleanPerturbationFailures type exposes the following members.
| Name| Description
---|---|---
| NonPerturbationBooleanFailed|  Boolean operation failed without perturbation.
Top
#### Reference
BuiltInFailuresToposolidBooleanPerturbationFailures Class
Autodesk.Revit.DB Namespace